In [55]:
import pandas as pd
import requests
from io import StringIO
import numpy as np

In [56]:
res1 = requests.get('https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/refs/heads/main/day34-handling-date-and-time/messages.csv').text
res2 = requests.get('https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/refs/heads/main/day34-handling-date-and-time/orders.csv').text
dfDate = pd.read_csv(StringIO(res2))
dfTime = pd.read_csv(StringIO(res1))

In [57]:
dfDate.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [58]:
dfDate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [59]:
dfDate['date'] = pd.to_datetime(dfDate['date'])

In [60]:
dfDate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [61]:
dfDate['year'] = dfDate['date'].dt.year
dfDate['month'] = dfDate['date'].dt.month
dfDate['month_name'] = dfDate['date'].dt.month_name()
dfDate['day'] = dfDate['date'].dt.day
dfDate['dayName'] = dfDate['date'].dt.day_name()
dfDate['week'] = dfDate['date'].dt.weekday
dfDate['dayOfWeek'] = dfDate['date'].dt.dayofweek
dfDate['quarter'] = dfDate['date'].dt.quarter
dfDate['semester'] = np.where(dfDate['quarter'].isin([1,2]), 1, 2)
dfDate['isWeekend'] = np.where(dfDate['dayName'].isin(['Sunday', 'Saturday']), True, False)

dfDate.head()

,date,product_id,city_id,orders,year,month,month_name,day,dayName,week,dayOfWeek,quarter,semester,isWeekend
0,2019-12-10,5628,25,3,2019,12,December,10,Tuesday,1,1,4,2,False
1,2018-08-15,3646,14,157,2018,8,August,15,Wednesday,2,2,3,2,False
2,2018-10-23,1859,25,1,2018,10,October,23,Tuesday,1,1,4,2,False
3,2019-08-17,7292,25,1,2019,8,August,17,Saturday,5,5,3,2,True
4,2019-01-06,4344,25,3,2019,1,January,6,Sunday,6,6,1,1,True

In [62]:
import datetime 
today = datetime.datetime.today()
today

datetime.datetime(2026, 1, 24, 13, 47, 56, 348704)

In [63]:
print('difference = ',today - dfDate['date'])

difference =  0     2237 days 13:47:56.348704
1     2719 days 13:47:56.348704
2     2650 days 13:47:56.348704
3     2352 days 13:47:56.348704
4     2575 days 13:47:56.348704
                 ...
995   2665 days 13:47:56.348704
996   2606 days 13:47:56.348704
997   2454 days 13:47:56.348704
998   2519 days 13:47:56.348704
999   2293 days 13:47:56.348704
Name: date, Length: 1000, dtype: timedelta64[ns]

In [64]:
print('days = ',(today - dfDate['date']).dt.days)

days =  0      2237
1      2719
2      2650
3      2352
4      2575
       ...
995    2665
996    2606
997    2454
998    2519
999    2293
Name: date, Length: 1000, dtype: int64

In [65]:
np.round((today - dfDate['date']) / np.timedelta64(1, 'D') / 30,0)

0      75.0
1      91.0
2      88.0
3      78.0
4      86.0
       ...
995    89.0
996    87.0
997    82.0
998    84.0
999    76.0
Name: date, Length: 1000, dtype: float64

## WORKING ON TIME

In [66]:
dfTime.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [67]:
dfTime['date'] = pd.to_datetime(dfTime['date'])

In [69]:
dfTime.head()

                 date                                                msg
0 2013-12-15 00:50:00                           ищу на сегодня мужика 37
1 2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2 2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3 2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4 2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [ ]:
dfTime['hour'] = dfTime['date'].dt.hour
dfTime['second'] = dfTime['date'].dt.second
dfTime['minute'] = dfTime['date'].dt.minute


dfTime.head()

,date,msg,hour,second,minute
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,0,50
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,0,40
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,0,21
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,0,31
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,0,11

In [78]:
(today - dfTime['date']) / np.timedelta64(1, 'm') #h, s

0      6.369898e+06
1      6.174128e+06
2      6.873927e+06
3      5.868797e+06
4      6.440557e+06
           ...
995    7.290058e+06
996    6.312394e+06
997    6.981971e+06
998    7.149014e+06
999    6.100703e+06
Name: date, Length: 1000, dtype: float64